"""
Создать список и заполнить его элементами различных типов данных. Реализовать
скрипт проверки типа данных каждого элемента. Использовать функцию type() для
проверки типа. Элементы списка можно не запрашивать у пользователя,
а указать явно, в программе
"""
my_list = ['megafon', 100, None, 55.5, ]
print(type(my_list[0]))
print(type(my_list[1]))
print(type(my_list[2]))
print(type(my_list[3]))
